In [3]:
import pandas as pd 
import numpy as np

In [4]:
import warnings
warnings.filterwarnings('ignore')

In [5]:
dim_date_df = pd.read_csv('dim_date.csv')
dim_hotels_df = pd.read_csv('dim_hotels.csv')
dim_rooms_df = pd.read_csv('dim_rooms.csv')
fact_aggregated_bookings_df = pd.read_csv('fact_aggregated_bookings.csv')
fact_bookings_df = pd.read_csv('fact_bookings.csv')

In [6]:
dim_date_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      92 non-null     object
 1   mmm yy    92 non-null     object
 2   week no   92 non-null     object
 3   day_type  92 non-null     object
dtypes: object(4)
memory usage: 3.0+ KB

In [7]:
dim_date_df.head(5)

        date  mmm yy week no  day_type
0  01-May-22  May 22    W 19   weekend
1  02-May-22  May 22    W 19  weekeday
2  03-May-22  May 22    W 19  weekeday
3  04-May-22  May 22    W 19  weekeday
4  05-May-22  May 22    W 19  weekeday

In [8]:
dim_hotels_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_id    25 non-null     int64
 1   property_name  25 non-null     object
 2   category       25 non-null     object
 3   city           25 non-null     object
dtypes: int64(1), object(3)
memory usage: 932.0+ bytes

In [9]:
dim_hotels_df.head(5)

   property_id  property_name  category    city
0        16558   Atliq Grands    Luxury   Delhi
1        16559  Atliq Exotica    Luxury  Mumbai
2        16560     Atliq City  Business   Delhi
3        16561      Atliq Blu    Luxury   Delhi
4        16562      Atliq Bay    Luxury   Delhi

In [10]:
dim_hotels_df['category'].unique()

array(['Luxury', 'Business'], dtype=object)

In [11]:
dim_rooms_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   room_id     4 non-null      object
 1   room_class  4 non-null      object
dtypes: object(2)
memory usage: 196.0+ bytes

In [12]:
dim_rooms_df.head(5)

  room_id    room_class
0     RT1      Standard
1     RT2         Elite
2     RT3       Premium
3     RT4  Presidential

In [13]:
dim_rooms_df['room_class'].unique()

array(['Standard', 'Elite', 'Premium', 'Presidential'], dtype=object)

In [14]:
dim_rooms_df['room_id'].unique()

array(['RT1', 'RT2', 'RT3', 'RT4'], dtype=object)

In [15]:
fact_aggregated_bookings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9200 entries, 0 to 9199
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   property_id          9200 non-null   int64
 1   check_in_date        9200 non-null   object
 2   room_category        9200 non-null   object
 3   successful_bookings  9200 non-null   int64
 4   capacity             9200 non-null   int64
dtypes: int64(3), object(2)
memory usage: 359.5+ KB

In [16]:
fact_aggregated_bookings_df.head(5)

   property_id check_in_date room_category  successful_bookings  capacity
0        16559     01-May-22           RT1                   25        30
1        19562     01-May-22           RT1                   28        30
2        19563     01-May-22           RT1                   23        30
3        17558     01-May-22           RT1                   13        19
4        16558     01-May-22           RT1                   18        19

In [17]:
fact_bookings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   booking_id         134590 non-null  object
 1   property_id        134590 non-null  int64
 2   booking_date       134590 non-null  object
 3   check_in_date      134590 non-null  object
 4   checkout_date      134590 non-null  object
 5   no_guests          134590 non-null  int64
 6   room_category      134590 non-null  object
 7   booking_platform   134590 non-null  object
 8   ratings_given      56683 non-null   float64
 9   booking_status     134590 non-null  object
 10  revenue_generated  134590 non-null  int64
 11  revenue_realized   134590 non-null  int64
dtypes: float64(1), int64(4), object(7)
memory usage: 12.3+ MB

In [18]:
fact_bookings_df.head(5)

,booking_id,property_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,ratings_given,booking_status,revenue_generated,revenue_realized
0,May012216558RT11,16558,2022-04-27,2022-05-01,2022-05-02,3,RT1,direct online,1.0,Checked Out,10010,10010
1,May012216558RT12,16558,2022-04-30,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
2,May012216558RT13,16558,2022-04-28,2022-05-01,2022-05-04,2,RT1,logtrip,5.0,Checked Out,9100,9100
3,May012216558RT14,16558,2022-04-28,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,9100,3640
4,May012216558RT15,16558,2022-04-27,2022-05-01,2022-05-02,4,RT1,direct online,5.0,Checked Out,10920,10920

In [19]:
fact_bookings_df['room_category'].unique()

array(['RT1', 'RT2', 'RT3', 'RT4'], dtype=object)

In [20]:
fact_aggregated_bookings_df['check_in_date'] = pd.to_datetime(fact_aggregated_bookings_df['check_in_date'], format='%d-%b-%y')
fact_bookings_df['check_in_date'] = pd.to_datetime(fact_bookings_df['check_in_date'], format='%Y-%m-%d')
dim_date_df['date'] = pd.to_datetime(dim_date_df['date'], format='%d-%b-%y')

In [21]:
merged_df = pd.merge(fact_bookings_df, dim_hotels_df, on="property_id", how="left")
merged_df = pd.merge(merged_df, dim_rooms_df, left_on="room_category", right_on="room_id", how="left")
merged_df = pd.merge(merged_df, fact_aggregated_bookings_df, on=["property_id", "check_in_date", "room_category"], how="left")
merged_df = pd.merge(merged_df, dim_date_df, left_on="check_in_date", right_on="date", how='left')

In [22]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 23 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   booking_id           134590 non-null  object
 1   property_id          134590 non-null  int64
 2   booking_date         134590 non-null  object
 3   check_in_date        134590 non-null  datetime64[ns]
 4   checkout_date        134590 non-null  object
 5   no_guests            134590 non-null  int64
 6   room_category        134590 non-null  object
 7   booking_platform     134590 non-null  object
 8   ratings_given        56683 non-null   float64
 9   booking_status       134590 non-null  object
 10  revenue_generated    134590 non-null  int64
 11  revenue_realized     134590 non-null  int64
 12  property_name        134590 non-null  object
 13  category             134590 non-null  object
 14  city                 134590 non-null  object
 15  room_id              134590 non-null  object
 16  room_class           134590 non-null  object
 17  successful_bookings  134590 non-null  int64
 18  capacity             134590 non-null  int64
 19  date                 134590 non-null  datetime64[ns]
 20  mmm yy               134590 non-null  object
 21  week no              134590 non-null  object
 22  day_type             134590 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(6), object(14)
memory usage: 23.6+ MB

In [23]:
merged_df.head(5)

,booking_id,property_id,booking_date,check_in_date,checkout_date,no_guests,room_category,booking_platform,ratings_given,booking_status,...,category,city,room_id,room_class,successful_bookings,capacity,date,mmm yy,week no,day_type
0,May012216558RT11,16558,2022-04-27,2022-05-01,2022-05-02,3,RT1,direct online,1.0,Checked Out,...,Luxury,Delhi,RT1,Standard,18,19,2022-05-01,May 22,W 19,weekend
1,May012216558RT12,16558,2022-04-30,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,...,Luxury,Delhi,RT1,Standard,18,19,2022-05-01,May 22,W 19,weekend
2,May012216558RT13,16558,2022-04-28,2022-05-01,2022-05-04,2,RT1,logtrip,5.0,Checked Out,...,Luxury,Delhi,RT1,Standard,18,19,2022-05-01,May 22,W 19,weekend
3,May012216558RT14,16558,2022-04-28,2022-05-01,2022-05-02,2,RT1,others,NaN,Cancelled,...,Luxury,Delhi,RT1,Standard,18,19,2022-05-01,May 22,W 19,weekend
4,May012216558RT15,16558,2022-04-27,2022-05-01,2022-05-02,4,RT1,direct online,5.0,Checked Out,...,Luxury,Delhi,RT1,Standard,18,19,2022-05-01,May 22,W 19,weekend

In [24]:
merged_df.isnull().sum()

booking_id                 0
property_id                0
booking_date               0
check_in_date              0
checkout_date              0
no_guests                  0
room_category              0
booking_platform           0
ratings_given          77907
booking_status             0
revenue_generated          0
revenue_realized           0
property_name              0
category                   0
city                       0
room_id                    0
room_class                 0
successful_bookings        0
capacity                   0
date                       0
mmm yy                     0
week no                    0
day_type                   0
dtype: int64

In [25]:
merged_df['ratings_given'].unique()

array([ 1., nan,  5.,  4.,  3.,  2.])

In [26]:
merged_df['ratings_given'].fillna(merged_df['ratings_given'].median(), inplace=True)

In [27]:
merged_df['ratings_given'].unique()

array([1., 4., 5., 3., 2.])

In [28]:
merged_df.isnull().sum()

booking_id             0
property_id            0
booking_date           0
check_in_date          0
checkout_date          0
no_guests              0
room_category          0
booking_platform       0
ratings_given          0
booking_status         0
revenue_generated      0
revenue_realized       0
property_name          0
category               0
city                   0
room_id                0
room_class             0
successful_bookings    0
capacity               0
date                   0
mmm yy                 0
week no                0
day_type               0
dtype: int64

In [29]:
merged_df.drop_duplicates(inplace=True)

In [30]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 23 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   booking_id           134590 non-null  object
 1   property_id          134590 non-null  int64
 2   booking_date         134590 non-null  object
 3   check_in_date        134590 non-null  datetime64[ns]
 4   checkout_date        134590 non-null  object
 5   no_guests            134590 non-null  int64
 6   room_category        134590 non-null  object
 7   booking_platform     134590 non-null  object
 8   ratings_given        134590 non-null  float64
 9   booking_status       134590 non-null  object
 10  revenue_generated    134590 non-null  int64
 11  revenue_realized     134590 non-null  int64
 12  property_name        134590 non-null  object
 13  category             134590 non-null  object
 14  city                 134590 non-null  object
 15  room_id              134590 non-null  object
 16  room_class           134590 non-null  object
 17  successful_bookings  134590 non-null  int64
 18  capacity             134590 non-null  int64
 19  date                 134590 non-null  datetime64[ns]
 20  mmm yy               134590 non-null  object
 21  week no              134590 non-null  object
 22  day_type             134590 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(6), object(14)
memory usage: 23.6+ MB

In [31]:
merged_df.drop(columns=["room_id", "date"], inplace=True)

In [32]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 21 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   booking_id           134590 non-null  object
 1   property_id          134590 non-null  int64
 2   booking_date         134590 non-null  object
 3   check_in_date        134590 non-null  datetime64[ns]
 4   checkout_date        134590 non-null  object
 5   no_guests            134590 non-null  int64
 6   room_category        134590 non-null  object
 7   booking_platform     134590 non-null  object
 8   ratings_given        134590 non-null  float64
 9   booking_status       134590 non-null  object
 10  revenue_generated    134590 non-null  int64
 11  revenue_realized     134590 non-null  int64
 12  property_name        134590 non-null  object
 13  category             134590 non-null  object
 14  city                 134590 non-null  object
 15  room_class           134590 non-null  object
 16  successful_bookings  134590 non-null  int64
 17  capacity             134590 non-null  int64
 18  mmm yy               134590 non-null  object
 19  week no              134590 non-null  object
 20  day_type             134590 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(6), object(13)
memory usage: 21.6+ MB

In [33]:
merged_df.rename(columns={'category': 'property_category', 'mmm yy':'month_year', 'week no':'week_no'}, inplace=True)

In [34]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 21 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   booking_id           134590 non-null  object
 1   property_id          134590 non-null  int64
 2   booking_date         134590 non-null  object
 3   check_in_date        134590 non-null  datetime64[ns]
 4   checkout_date        134590 non-null  object
 5   no_guests            134590 non-null  int64
 6   room_category        134590 non-null  object
 7   booking_platform     134590 non-null  object
 8   ratings_given        134590 non-null  float64
 9   booking_status       134590 non-null  object
 10  revenue_generated    134590 non-null  int64
 11  revenue_realized     134590 non-null  int64
 12  property_name        134590 non-null  object
 13  property_category    134590 non-null  object
 14  city                 134590 non-null  object
 15  room_class           134590 non-null  object
 16  successful_bookings  134590 non-null  int64
 17  capacity             134590 non-null  int64
 18  month_year           134590 non-null  object
 19  week_no              134590 non-null  object
 20  day_type             134590 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(6), object(13)
memory usage: 21.6+ MB

In [35]:
merged_df["booking_date"] = pd.to_datetime(merged_df["booking_date"])
merged_df["checkout_date"] = pd.to_datetime(merged_df["checkout_date"])

In [36]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134590 entries, 0 to 134589
Data columns (total 21 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   booking_id           134590 non-null  object
 1   property_id          134590 non-null  int64
 2   booking_date         134590 non-null  datetime64[ns]
 3   check_in_date        134590 non-null  datetime64[ns]
 4   checkout_date        134590 non-null  datetime64[ns]
 5   no_guests            134590 non-null  int64
 6   room_category        134590 non-null  object
 7   booking_platform     134590 non-null  object
 8   ratings_given        134590 non-null  float64
 9   booking_status       134590 non-null  object
 10  revenue_generated    134590 non-null  int64
 11  revenue_realized     134590 non-null  int64
 12  property_name        134590 non-null  object
 13  property_category    134590 non-null  object
 14  city                 134590 non-null  object
 15  room_class           134590 non-null  object
 16  successful_bookings  134590 non-null  int64
 17  capacity             134590 non-null  int64
 18  month_year           134590 non-null  object
 19  week_no              134590 non-null  object
 20  day_type             134590 non-null  object
dtypes: datetime64[ns](3), float64(1), int64(6), object(11)
memory usage: 21.6+ MB

In [37]:
merged_df.to_csv('hotel_dataset.csv', index=False)